{
    "messages": [
        {
            "date": "2020.10.15",
            "title": "Avondritueel / Evening Ritual",
            "sections": [
                "Another recording of one of my favorite pieces. For a long time, back when I still lived in Amsterdam, this was the (only) piece I kept playing night after night (on my digital piano). It really became like an <i>Evening Ritual</i> to me.",
                "This composition still amazes me, I'm really proud of it. I recall that the idea for this piece was born at an acoustic upright piano from my brother in law, in their apartment in Amsterdam. They were on holiday, and we were taking care of their cat and plants. There was an opportunity to play at their unique and for me unfamiliar instrument. I find that often these are the occasions that new ideas pop up."
            ],
            "video": "https://www.youtube.com/embed/Q7vmKIz-BqI"
        },
        {
            "date": "2020.10.14",
            "title": "Vaarwel / Farewell",
            "sections": [
                "I decided to ditch SoundCloud as the home for my recordings. Instead, I'm sticking with the YouTube channel, to be able to include visuals too. I therefore rerecorded the pieces from early June.",
                "This one was initially known as <i>Paardenbloempluisjes / Dandelion Fluff</i>, but I think the heavy ending doesn't really match with this title. So instead, I went for a title closer to what this piece means to me. I've played this piece at my grandfather's funeral, as well as at the funeral of my wife's grandfather. To me this has become something like a 'positive' elegy. It's a <i>Vaarwel/ Farewell</i>."
            ],
            "video": "https://www.youtube.com/embed/rX2qOezLaQI"
        },
        {
            "date": "2020.09.17",
            "title": "Panorama",
            "sections": [
                "Since I revealed the first three demo tracks back in June, I became really enthusiastic to finish some pieces that had been lying around for a while. I had never found an ending for them, or perhaps said better, I had never took the time to find an ending.Creativity really got a boost from all the positive reactions and I managed to finish two pieces in the last couple of months. Next to that I have a handful of ideas for new pieces, so all in all it has been quite a productive period.",
                "I've set myself a goal to have material for a complete album by August 2021. According to Spotify that should be at least 10 songs or a minimum of 30 minutes worth of music :-)",
                "The latest composition that I have recorded at home is called <i>Panorama</i>. And this time you can also watch how it came to exist!"
            ],
            "video": "https://www.youtube.com/embed/xwUH5VjHtfM"
        }
    ]
}